{
  "design":
    {
      "name": "design",
      "context": [
        {
          "classe": "collapse_One",
          "title": "Prototype et conception UX",
          "desc": "Pour la conception d’une UX efficace et accessible, je m’inspire et respecte les tendances web ainsi que les bonnes pratiques afin de rendre un prototype intéractif et intuitif."
        },
        {
          "classe": "collapse_Two",
          "title": "Conception UI",
          "desc": "L'interface utilisateur est un point non négligeable pour mettre en confiance un client. Une interface épurée, légère et responsive donne immédiatement un sentiment de propreté et de professionnalisme."
        },
        {
          "classe": "collapse_Three",
          "title": "Navigation et Animation",
          "desc": "Un effet de perspective, un bouton animé, une réaction de l’interface avec le curseur ou la molette de l’utilisateur…, cela donne vie à l’interface et rend la navigation plus attrayante. C’est toujours un plaisir mais aussi un défi de trouver un comportement inédit et créatif, ainsi qu’un style personnalisé pour chaque projet."
        },
        {
          "classe": "collapse_Four",
          "title": "Mes connaissance",
          "desc": "Photophop - Illutrator - XD"
        }
      ]
    },
  "programmation":
  {
    "name": "programmation",
    "context": [
      {
        "classe": "collapse_Five",
        "title": "Programmation et process",
        "desc": "Le code, est l’identification d’un développeur sur sa façon de structurer et d’organiser un projet. Respecter le processus d’une entitée, est crucial pour un code propre et son évolution."
      },
      {
        "classe": "collapse_Six",
        "title": "JavaScript",
        "desc": "Le JavaScript est mon principal langage de programmation. Des fonctions lisibles et des composants réutilisables sont primordiaux dans un projet développé seul ou à plusieurs."
      },
      {
        "classe": "collapse_Seven",
        "title": "Frameworks",
        "desc": "Les frameworks vont me permettre d’obtenir un code plus simple, plus léger et me faciliter la tâche pour la création d’une application web. La gestion des composants et de leurs états, en les hiérarchisant séparément, me permet d’obtenir une structure fluide et claire."
      },
      {
        "classe": "collapse_Eight",
        "title": "Mes connaissance",
        "desc": "Html/Css - Sass - Bootstrap/Tailwind - JavaScript - React/Nextjs - TypeScript in react - Npm - Git"
      }
    ]
  },
  "backend":
  {
    "name": "backend",
    "context": [
      {
        "classe": "collapse_Nine",
        "title": "Le Backend",
        "desc": "La partie invisible est la plus importante pour la gestion des données. Savoir traiter et sécuriser des requêtes avec un serveur ou une API est toujours une procédure délicate."
      },
      {
        "classe": "collapse_Ten",
        "title": "Json",
        "desc": "La légèreté et la lisibilité du format JSON reste pour moi simple et efficace. La combinaison clé/ valeur, et son typage au sein d’un objet ou d’un tableau, est pour moi une approche moderne et concorde avec les langages que j'utilise."
      },
      {
        "classe": "collapse_Eleven",
        "title": "Interface de programmation d'application",
        "desc": "Les API sont très largement utilisées et il est important de savoir lire une documentation pour comprendre son fonctionnement."
      },
      {
        "classe": "collapse_Twelve",
        "title": "Mes connaissance",
        "desc": "NodeJs - Express - Postman - MongoDB - NOsql - Linux - Nginx - Pm2 - AWS - EC2 - Amplify"
      }
    ]
  }
}

